show tables;

CREATE TABLE PROJECT_TEAM(
TEAMID VARCHAR(20) PRIMARY KEY,
TEAMNAME VARCHAR(20)
);

SELECT * FROM PROJECT_TEAM;

INSERT INTO project_team
VALUES
('ATEAM', 'NOLJA'),
('HTEAM', 'JIEUNJIP'),
('CTEAM', 'CODINGSTAR'),
('STEAM', 'TURTLEKING'),
('NONE', 'NONE')
;

CREATE TABLE MEMBER(
MEMBERID VARCHAR(20) PRIMARY KEY,
TEAMID VARCHAR(20),
NAME VARCHAR(20),
SSN VARCHAR(20),
ROLL VARCHAR(20),
PASS VARCHAR(20),
AGE VARCHAR(20),
GENDER VARCHAR(20),
SUJECT VARCHAR(20),
EMAIL VARCHAR(20),
PHONE VARCHAR(20),
FOREIGN KEY (TEAMID) REFERENCES project_team(TEAMID)
);

SELECT * FROM MEMBER;

DROP TABLE MEMBER;

INSERT INTO MEMBER
(MEMBERID,TEAMID,NAME,AGE,ROLL,PASS,SSN,GENDER)
VALUES
('A1','ATEAM','형준','34','leader','1','850619-2','남');

INSERT INTO MEMBER
(MEMBERID,TEAMID,NAME,AGE,ROLL,PASS,SSN,GENDER)
VALUES
("A1","ATEAM","형준","34","leader","1","850619-2","남"),
("A2","ATEAM","세인","35","팀원","1","841027-2","남"),
("A3","ATEAM","희태","21","팀원","1","980813-1","남"),
("A4","ATEAM","상훈","29","팀원","1","900112-1","남"),
("A5","ATEAM","태형","25","팀원","1","940526-2","남"),
("H1","HTEAM","혜리","25","leader","1","930713-1","남"),
("H2","HTEAM","지은","25","팀원","1","930304-2","남"),
("H3","HTEAM","준","25","팀원","1","920211-1","남"),
("H4","HTEAM","재경","30","팀원","1","890527-2","남"),
("H5","HTEAM","단아","26","팀원","1","930705-2","남"),
("C1","CTEAM","최정훈","32","leader","1","870710-1","남"),
("C2","CTEAM","김윤호","31","팀원","1","880725-2","남"),
("C3","CTEAM","가은","29","팀원","1","900718-2","남"),
("C4","CTEAM","정훈","23","팀원","1","960124-1","남"),
("C5","CTEAM","승태","30","팀원","1","890904-1","남"),
("S1","STEAM","승호","27","leader","1","920124-2","남"),
("S2","STEAM","소진","26","팀원","1","931129-1","남"),
("S3","STEAM","이슬","29","팀원","1","900919-1","남"),
("S4","STEAM","진태","26","팀원","1","930821-2","남"),
("S5","STEAM","누리","30","팀원","1","890403-2","남"),
("C16","NONE","홍수","42","NONE","1","771201-2","남"),
("C9","CTEAM","강감찬","52","back","1","670824-1","남"),
("C6","CTEAM","홍길동","31","back","1","881111-1","남"),
("C22","CTEAM","수세미","24","android","1","940311-2","여"),
("C8","CTEAM","이순신","40","back","1","790411-1","남"),
("C12","CTEAM","장보고","56","back","1","631013-1","남"),
("C13","CTEAM","최영","81","back","1","380915-1","남"),
("C14","CTEAM","장영실","54","back","1","650515-1","남"),
("C15","CTEAM","이율곡","89","back","1","300307-1","남"),
("C17","NONE","조광조","73","NONE","1","460526-1","남"),
("C18","NONE","김유신","55","NONE","1","640716-1","남"),
("C19","NONE","곽재우","46","NONE","1","731005-1","남"),
("C20","NONE","양만춘","96","NONE","1","230830-1","남"),
("C7","CTEAM","정몽주","63","back","1","561209-1","남"),
("C11","CTEAM","이방원","42","back","1","770411-1","남"),
("A13","ATEAM","조홍","67","front","1","510715-1","남"),
("CC","CTEAM","홍길동","30","back","1","881111-1","남"),
("C21","STEAM","포륭","45","android","1","740221-1","남"),
("A6","ATEAM","조조","55","front","1","631011-1","남"),
("A7","ATEAM","조비","45","back","1","731007-1","남"),
("A8","ATEAM","조식","44","android","1","740211-1","남"),
("A9","ATEAM","조창","41","minfe","1","770211-1","남"),
("A10","ATEAM","조충","24","android","1","940318-1","남"),
("A11","ATEAM","조진","29","front","1","890121-1","남"),
("A12","ATEAM","조절","34","android","1","840511-2","여"),
("A14","ATEAM","조앙","46","back","1","721107-1","남"),
("A15","ATEAM","조안민","34","android","1","840511-1","남"),
("S6","STEAM","손권","26","front","1","920811-1","남"),
("S7","STEAM","손책","42","android","1","760619-1","남"),
("S8","STEAM","손상향","21","back","1","971225-2","여"),
("S9","STEAM","육손","33","front","1","851111-1","남"),
("S10","STEAM","주유","39","back","1","790719-1","남"),
("S11","STEAM","정보","53","back","1","650819-1","남"),
("S12","STEAM","황개","83","android","1","350314-1","남"),
("S13","STEAM","여몽","50","back","1","680101-1","남"),
("S14","STEAM","태사자","35","back","1","830905-1","남"),
("S15","STEAM","반장","31","front","1","870407-1","남"),
("H6","HTEAM","유비","64","back","1","540605-1","남"),
("H7","HTEAM","유선","19","front","1","990711-1","남"),
("H8","HTEAM","유리","31","back","1","870811-1","남"),
("H9","HTEAM","유봉","43","front","1","750928-1","남"),
("H10","HTEAM","조운","41","front","1","770717-1","남"),
("H11","HTEAM","장비","56","android","1","620911-1","남"),
("H12","HTEAM","관우","60","back","1","580613-1","남"),
("H13","HTEAM","관평","36","back","1","820917-1","남"),
("H14","HTEAM","장포","27","android","1","910623-1","남"),
("H15","HTEAM","관흥","35","front","1","830301-1","남"),
("Y2","NONE","원상","33","none","1","850811-1","남"),
("Y1","NONE","원소","41","none","1","771101-1","남"),
("Y3","NONE","원담","31","none","1","870414-1","남"),
("Y4","NONE","원희","42","none","1","760901-1","남"),
("Y5","NONE","문추","55","none","1","630730-1","남")
;







